package com.eomcs.basic.ex04;

public class Exam0422 {
  public static void main(String[] args) {
    
    // 8바이트 부동소수점 변수
    // - 유효자릿수 15자리 부동소수점 저장 가능
    // - 10진수로 부동소수점을 표현할 경우 
    //   소수점을 제외한 숫자가 15개인 경우 
    //   정상적으로 메모리에 저장된다는 의미 
    
    double d;
    
    d = 9.99999999988888;
    System.out.println(d);  //9.99999999988888
    
    d = 9999999999.88888;
    System.out.println(d);  //9.99999999988888E9
    
    d = 99999999998888.8;
    System.out.println(d);  //9.99999999988888E13
    
    d = 0.00000999999999988888;
    System.out.println(d);  //9.99999999988888E-6
    
    // 유효자릿수가 15자리를 넘어가는 경우 
    d = 9.999999999999997;  //맨 뒤의 값이 반올림되거나 잘린다.
    System.out.println(d);  //9.999999999999996
    
    d = 999999999999999.7;  //맨 뒤의 값이 반올림되거나 잘린다.
    System.out.println(d);  //9.999999999999998E14
    
    // 주의
    // '유효자릿수'는 부동소수점의 저장 가능 여부를 간단히 계산하기 위해 나온 개념
    // 실제는 유효자릿수에 해당하는 부동소수점이라도 정규화 과정을 통해 2진수로 변환되는 과정에서
    // 값이 잘리는 경우가 있음!
    
    // 단정도와 배정도
  }
}
