package com.eomcs.basic.ex04;

//# 정수 변수 - 변수의 메모리 크기 

public class Exam0411 {
  public static void main(String[] args) {
    byte b;
    
    b = -128;
    b = 127;
    
    //b = -129;
    //b = 128;
    
    short s;
    
    s = -32768;
    s = 32767;
    
    //s = -32769;
    //s = 32768;
    
    int i;
    
    i = -2147483648;
    i = 2147483647;
    
    // 값을 저장할 메모리의 크기 때문에 발생한 오류가 아니라
    // 리터럴 크기의 문제
    // 정수 값 뒤에 L을 붙이지 않은 리터럴은 4바이트 그리를 의미
    // 그런데 4바이트를 넘어서는 값을 리터럴로 표현했기 때문에 오류가 발생한 것
    // 리터럴은? 자바 언어로 표현한 값

    //i = -2147483649;
    //i = 2147483648;
    
    // 해결책?
    //i = -2147483649L;
    //i = 2147483648L;
    
    long l;
    
    l = -9223372036854775808L;
    l = -9223372036854775807L;
  }
}
